<html>
  <body>
    <div class="container" id="container">
      <div class="col-xs-12 col-sm-9">

      <div class="jumbotron">
           <p>1.2.2 具物件導向技術的語言</p>
            C與C++的最大差別在於C++具備物件導向的功能，「類別」是實現物件導向程式設計的重要概念，因此早期C++也被稱為「具有類別的C語言」。一般而言，物件導向程式設計（Object-Oriented programming，OOP）具有三個重要相關的技術，分別為「封裝」、「繼承」與「多型」。
            <br>
．「封裝」是將資料和函數都包裝在類別內部的一種技術，他限定只有某些函數才能存取特定的成員，用以保護資料的安全．
<br>
．「繼承」是將既有的類別的功能，透過繼承的方式使該功能繼承給新的類別使用，因此新的類別不需要撰寫相同的程式碼，以達到簡化程式碼與程式再利用的目的。
<br>
．「多型」則允許相同名稱的函數針針對引數的不同而進行不同的處理動作。


      </div>
      </div>
    </div>
  </body>
</html>