<html>
  <body>
    <div class="container" id="container">
      <div class="col-xs-12 col-sm-9">

      <div class="jumbotron">
           <p>*第一章 重點整理</p>
           <br>
           1.C++以「C with classes」為基礎，加入封裝(encapsulation)、繼承(inheritance)與多型(polymorphism)等功能，使得它成為一個兼容並蓄的語言。
           <br>
2.物件導向程式設計(OOP)具有三個重要的相關技術，分別為「封裝」、「繼承」與「多型」。
<br>
3.編譯式語言式透過編譯器(compiler)把程式碼轉換成電腦所能執行的語言，而直譯語言則是透過直譯器(interpreter)一邊翻譯一邊執行，但它一次只能夠將一行程式送進CPU，進行編譯和執行的動作。
<br>
4.設計程式所需的六個步驟分別為:規劃程式、撰寫程式碼及註解、編譯程式、連結程式、偵錯與測試、程式碼的修飾與儲存。
<br>
5.C++的變數可以是英文字母、數字或底線。但要注意，名稱中不能有空白字元，且第一個字元不能是數字，也不能是C++的關鍵字。此外，C++的變數有大小寫之分。
<br>
6.提高程式可讀性的的方法為: (1)使用固定字距 (2)將程式敘述縮排，(3)在程式中加上註解，(4)為變數取個有意義的名稱，(5)保持每行只有一個敘述，(6)適當的空行與空白等。
<br>
7.C++的註解有兩種: (1)「//」記號開始，至該行結束，(2)「*」與「*/」這兩個符號之間的文字。
<br>



      </div>
      </div>
    </div>
  </body>
</html>